# ExternalResourceReference Constructor (ExternalResourceReference)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceReference Constructor (ExternalResourceReference)
ExternalResourceReference Class See Also
---
Creates a new ExternalResourceReference from the given ExternalResourceReference.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ExternalResourceReference(
	ExternalResourceReference other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As ExternalResourceReference _
)
```

Visual C++
---
```text
public:
ExternalResourceReference(
	ExternalResourceReference^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB..::..ExternalResourceReference The ExternalResourceReference to copy.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExternalResourceReference Class
ExternalResourceReference Overload
Autodesk.Revit.DB Namespace